{
  "speakers": [
    {
      "name": "Reginald Braithwaite",
      "bio": "Reginald Braithwaite is a software developer at Leanpub, where he and his colleagues take the friction out of writing and selling books. He has more than twenty years of hands-on experience creating software products and leading software teams. He currently applies extremely deep Ruby, JavaScript, CoffeeScript, and advanced programming expertise to crafting well-factored, maintainable code. In previous roles he has applied his analytical and communication experience to developing requirements, documenting specifications, and managing relationships with people and teams. He is a respected speaker and author on subjects ranging from managing development and not-so-big design to and extreme hackery such as dynamic meta-programming. His recent open source includes Cafe au Life, Method Combinators, andand, and jQuery Combinators.",
      "photo_url": "/images/speaker-reginald-braithwaite.jpg"
    },
    {
      "name": "Sławomir Sobótka",
      "bio": "Hands-on systems designer, head coach at Bottega IT Solutions [http://www.bottega.com.pl] specialized in Enterprise Java technologies and effective utilization of modern software engineering techniques Interested in broadly defined software engineering: architecture of highly efficient/productive web systems (particularly   CqRS), modeling ( particularly  DDD) , design patterns, agile development.  Interested in Cognitive Science and psychology. Software Craftsmanship enthusiast Participates in social community as: president of Polish Software Engineering Professionals Association [http://ssepp.pl], publisher, speaker and blogger [http://art-of-software.blogspot.com/]",
      "photo_url": "/images/speaker-slawomir-sobotka.jpg"
    },
    {
      "name": "Brian Morton",
      "bio": "Brian is a software engineer at Yammer in San Francisco where he builds software to change the way the world gets work done. He's obsessed with clean code, simple solutions to hard problems, and drinking whisky, but not always in that order. In his free time, he loves contributing to open source, playing Zelda, and spinning records on Serato.",
      "photo_url": "http://placekitten.com/g/297/396"
    }
  ],
  "supporters": [
    {
      "name": "DRUG",
      "website_url": "http://drug.org.pl",
      "logo_url": "images/drug-logo.png"
    }
  ]
}

